export const filmsData = [
  {
    id: 0,
    name: "Друзья",
    year: "1994 – 2004",
    description:
      "Шестеро друзей – Рейчел, Моника, Фиби, Джоуи, Чендлер и Росс – живут по соседству, вместе убивают время, делятся секретами и иногда очень сильно влюбляются.",
    actors: [
      { name: "Дженнифер Энистон" },
      { name: "Кортни Кокс" },
      { name: "Лиза Кудроу" },
      { name: "Мэтт ЛеБлан" },
      { name: "Мэттью Перри" },
      { name: "Дэвид Швиммер" },
    ],
    type: "series",
    rating: 9.2,
    genres: [{ name: "комедия" }, { name: "мелодрама" }],
  },
  {
    id: 1,
    name: "Элементарно",
    year: "2023",
    description:
      "В Элемент-Сити обитатели огня, воды, земли и воздуха живут вместе. У сильной и вспыльчивой Эмбер завязывается дружба с расслабленным, плывущим по течению Уэйдом — дружба, которая бросит вызов её представлениям о мире вокруг.",
    actors: [
      { name: "Леа Льюис" },
      { name: "Мамуду Ати" },
      { name: "Роналдо Дель Кармен" },
    ],
    type: "cartoon",
    rating: 7.7,
    genres: [
      { name: "мультфильм" },
      { name: "фэнтези" },
      { name: "драма" },
      { name: "мелодрама" },
      { name: "комедия" },
      { name: "приключения" },
      { name: "семейный" },
    ],
  },
  {
    id: 2,
    name: "Уэнсдэй",
    year: "2022 – ...",
    description:
      "Уэнсдэй, дочь Гомеса и Мортиши Аддамс, учится в академии Nevermore. Ей предстоит освоить экстрасенсорные способности, чтобы остановить местного серийного убийцу и раскрыть тайну родителей.",
    actors: [
      { name: "Дженна Ортега" },
      { name: "Эмма Майерс" },
      { name: "Хантер Дуэн" },
      { name: "Перси Хайнс Уайт" },
    ],
    type: "series",
    rating: 8.0,
    genres: [
      { name: "фэнтези" },
      { name: "комедия" },
      { name: "криминал" },
      { name: "детектив" },
    ],
  },
  {
    id: 3,
    name: "Дьявол носит Prada",
    year: "2006",
    description:
      "Мечтающая стать журналисткой провинциальная девушка Энди по окончании университета получает должность помощницы всесильной Миранды Пристли, деспотичного редактора одного из крупнейших нью-йоркских журналов мод. Энди всегда мечтала о такой работе, не зная, с каким нервным напряжением это будет связано...",
    actors: [
      { name: "Мэрил Стрип" },
      { name: "Энн Хэтэуэй" },
      { name: "Эмили Блант" },
      { name: "Стэнли Туччи" },
      { name: "Саймон Бейкер" },
    ],
    type: "movie",
    rating: 7.7,
    genres: [{ name: "драма" }, { name: "комедия" }],
  },
];
